; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-7-0)
(:domain BLOCKS)
(:objects A B C D E F G - block)
(:INIT (CLEAR E) (CLEAR G) (ONTABLE A) (ONTABLE F) (ON E D) (ON D C) (ON C B) (ON B A) (ON G F) (HANDEMPTY))
(:goal (AND (ON A E) (ON E B) (ON B F) (ON F G) (ON G C) (ON C D)))
)

; plan
1. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holding e) (clear d)
   goals met: 0 of 6
2. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 0 of 6
3. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 6
4. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 0 of 6
5. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 0 of 6
6. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 1 of 6
7. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 1 of 6
8. (stack g c)
   deleted: (holding g) (clear c)
   added: (clear g) (handempty) (on g c)
   goals met: 2 of 6
9. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 2 of 6
10. (stack f g)
   deleted: (holding f) (clear g)
   added: (clear f) (handempty) (on f g)
   goals met: 3 of 6
11. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 3 of 6
12. (stack b f)
   deleted: (holding b) (clear f)
   added: (clear b) (handempty) (on b f)
   goals met: 4 of 6
13. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 4 of 6
14. (stack e b)
   deleted: (holding e) (clear b)
   added: (clear e) (handempty) (on e b)
   goals met: 5 of 6
15. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 6
16. (stack a e)
   deleted: (holding a) (clear e)
   added: (clear a) (handempty) (on a e)
   goals met: 6 of 6
